/* Task #2:
- Напишите функцию min(a,b), которая возвращает меньшее из чисел a,b
 Случай равенства a == b здесь отдельно не рассматривается, так как при этом неважно, что возвращать.
--------------------------------------
Пример вызовов:
	min(2, 5) // 2
	min(3, -1) // -1
	min(1, 1) // 1
--------------------------------------
=====================================*/

// 1 вариант решения =====================================
function min(a, b) {
	if (a > b) {
		return b;
	} else {
		return a;
	}
}
console.log(min(2, 5) );
console.log(min(3, -1));
console.log(min(1, 1));

// 2 вариант решения =====================================
function min(a, b) {
	return (a > b) ? b : a;
}
console.log(min(2, 5));
console.log(min(3, -1));
console.log(min(1, 1));

// 3 вариант решения =====================================
function min(a, b) {
	return Math.min(a, b);
}
console.log(min(2, 5));
console.log(min(3, -1));
console.log(min(1, 1));